log/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-12-02 Wed 08:55 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Log Files: Giv&rsquo;r and GTD!</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Drew Crampsie">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Log Files: Giv&rsquo;r and GTD!</h1>
</header><p>
While developing <b>GxQuasar</b> I do so literately<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. Often my logs contain the
source code and regardless, in and of themselves, they are useful to all.
</p>

<p target="&quot;_blank&quot;">
If you find aaanything amiss make sure to <a href="https://github.com/drewc/gx-quasar/issues" target="&quot;_blank&quot;">let me know</a>.
</p>

<p>
The first is actually numbered 0, but since lists seem to start at one, it is
also <a href="0000_Getting-Started.html">unlisted</a>, titled <b>gx-quasar-&gt;GxQuasar: a simple idea to Gerbilize
Javascript</b>. Of important note is <a href="0000_Getting-Started.html#thirdreinit">Third Attempt: re-init registry</a>, where I begin
to figure out <b>Gambit</b>&rsquo;s module registry in <b>JavaScript</b>.
</p>

<ol class="org-ol">
<li><p>
<a href="0001_Make-It-Useful.html">Make It Useful: Lazy, Links and Publish</a>.
</p>

<p>
I start to lazy-load things and make a <a href="0001_Make-It-Useful.html#plist-&gt;jso">plist-&gt;jso</a> that&rsquo;s quite useful.
</p></li>

<li><p>
<a href="0002_Lazy-Dynamic-Module-Init.html">Lazy Load, Dynamic modules, initialized</a>.
</p>

<p>
This is where I finally figure out how to bypass, or use the way it was
intended, the <a href="0002_Lazy-Dynamic-Module-Init.html#RegisterJumpOnTrampoline"><code>g_module_register</code></a>. In particular I made a
<code>g_module_init(...)</code> function. Now I can load anything at will, including
the entire gambit runtime.
</p>

<p>
Also of interest is the first <b>Vue.js</b> component created <a href="0002_Lazy-Dynamic-Module-Init.html#FirstVueGx">entirely in gerbil</a>.
</p></li>

<li><p>
<a href="0003_More-run-time-and-more-vue.html">More Run Time, More Vue</a>.
</p>

<p>
I futz with <code>g_scm2host</code> and <code>g_host2scm</code> to make them &ldquo;work&rdquo; with foreign
objects. Now an alist can become a <b>JavaScript</b> object, but not <i>vice
versa</i>.
</p>

<p>
Using that enables a trivial <a href="0003_More-run-time-and-more-vue.html#jsFunctionAndThis"><code>js#function</code></a>, which allows a lexical <code>js#this</code>
variable as well as a variable number of arguments totally unspecified, like <code>js</code>.
</p>

<p>
Needing a way to both create and reference our foreign <code>jso</code>&rsquo;s, we do so.
<a href="0003_More-run-time-and-more-vue.html#jsJsoRefAndRefSet"><code>js#jso</code> and <code>js#ref</code></a>
</p>

<p>
Using that and a wee bit more we are able to port a <b>Vue</b> component&rsquo;s render
function over to scheme in a near identical manner.
</p></li>
</ol>

<div id="outline-container-org7e34b70" class="outline-2">
<h2 id="org7e34b70">Notes</h2>
<div class="outline-text-2" id="text-org7e34b70">
<p>
This is just the very start but already has me very excited. Gerbil in/on the
browser!
</p>

<p>
Just the kernel runtime? <a href="http://gambitscheme.org/wiki/index.php/GambitNds">http://gambitscheme.org/wiki/index.php/GambitNds</a>
</p>

<p>
Tree shake? <a href="https://mailman.iro.umontreal.ca/pipermail/gambit-list/2008-October/002808.html">https://mailman.iro.umontreal.ca/pipermail/gambit-list/2008-October/002808.html</a>
</p>

<p>
Relevant compile thingies. <a href="https://mailman.iro.umontreal.ca/pipermail/gambit-list/2019-October/009189.html">https://mailman.iro.umontreal.ca/pipermail/gambit-list/2019-October/009189.html</a>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Literate_programming">https://en.wikipedia.org/wiki/Literate_programming</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2020-11-23 Mon 00:00</p>
<p class="author">Author: Drew Crampsie</p>
<p class="date">Created: 2020-12-02 Wed 08:55</p>
</div>
</body>
</html>
